# 데이터프레임에 함수 적용

In [1]:
import pandas as pd
import numpy as np

## 어플라이(apply)
* 데이터 프레임에 행 혹은 열 방향으로 지정한 함수를 수행하고 그 값을 결과로 받는다.
* 집계함수로도 적용가능

In [11]:
score = {'학년':[1, 1, 1, 1, 2, 2], 
         '반':['A', 'A', 'B', 'B', 'C', 'C'], 
         '성별':['여자', '남자', '여자', '남자', '여자', '남자'],
         '성적': [76, 88, 85, 72, 68, 70]}
score

{'학년': [1, 1, 1, 1, 2, 2],
 '반': ['A', 'A', 'B', 'B', 'C', 'C'],
 '성별': ['여자', '남자', '여자', '남자', '여자', '남자'],
 '성적': [76, 88, 85, 72, 68, 70]}

In [12]:
score = pd.DataFrame(score)
score

   학년  반  성별  성적
0   1  A  여자  76
1   1  A  남자  88
2   1  B  여자  85
3   1  B  남자  72
4   2  C  여자  68
5   2  C  남자  70

In [13]:
score = score.pivot_table(index=['학년', '반'], columns='성별', values='성적')
score

성별    남자  여자
학년 반
1  A  88  76
   B  72  85
2  C  70  68

In [14]:
score.apply(np.sqrt, axis = 0)

성별          남자        여자
학년 반
1  A  9.380832  8.717798
   B  8.485281  9.219544
2  C  8.366600  8.246211

In [15]:
score.apply(np.max, axis=0)

성별
남자    88
여자    85
dtype: int64

* apply 함수에 직접 정의한 함수 역시 적용가능

In [16]:
def plus_five(val):
    return val + 5

In [17]:
score.apply(plus_five)

성별    남자  여자
학년 반
1  A  93  81
   B  77  90
2  C  75  73

In [18]:
from math import ceil
def class_avg(df):
    return ceil((df['남자'] + df['여자'])/2)

In [19]:
score.apply(class_avg, axis=1)

학년  반
1   A    82
    B    79
2   C    69
dtype: int64

## map

* 주어진 각 원소에 함수를 적용
* 함수를 정의하는 lambda와 함께 사용 가능
* map(lambda)를 사용할 때는 데이터가 시리즈 형태

In [20]:
score['남자'].map(lambda x: x + 5)

학년  반
1   A    93
    B    77
2   C    75
Name: 남자, dtype: int64